app/views/lists/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]
---
<<<<<<< HEAD
    <% @list.items.each do |item| %>