app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "groceries"], ["created_at", "2018-01-02 13:34:45.894730"], ["updated_at", "2018-01-02 13:34:45.894730"]]