app/controllers/sessions_controller.rb

  def create

    if auth_hash = request.env["omniauth.auth"]
      # raise "Exiting User Loggin In Via Github".inspect
      user = User.find_or_create_by_omniauth(auth_hash)
      session[:user_id] = user.id
      redirect_to root_path
    else
      #normal login
      user = User.find_by(:email => params[:email])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "rob@rob.com"]]