app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "rob@email.com"], ["created_at", "2018-01-02 16:35:49.213927"], ["updated_at", "2018-01-02 16:35:49.213927"]]
---
  def create
    @user = User.new
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    if @user.save